# Key Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefinitionBindingMapIterator..::..Key Property
DefinitionBindingMapIterator Class See Also
---
Retrieves the definition that is the current focus of the iterator.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual Definition Key { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Key As Definition
	Get
```

Visual C++
---
```text
public:
virtual property Definition^ Key {
	Definition^ get ();
}
```

# Remarks
A new or Reset iterator must have MoveNext called on it before Current will return a valid key as per expected behavior of IEnumerator.
# See Also
DefinitionBindingMapIterator Class
Autodesk.Revit.DB Namespace